# 1. Задайте список из нескольких чисел.
# Напишите программу, которая найдёт сумму элементов списка,
# стоящих на нечётной позиции.
# Пример:
# - [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12

# array = [2, 3, 5, 9, 3]
# summ = 0
# for i in range(1, len(array), 2):
#     summ = summ + array[i]
# print(summ)

# 2. Напишите программу, которая найдёт произведение пар чисел списка.
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример:
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

# import math
#
# array = [2, 3, 4, 5, 6]
# prod_array = []
# prod = 1
# for i in range(math.ceil(len(array)/2)):
#     prod_array.append(int(array[i] * array[len(array)-i-1]))
# print(prod_array)

# 3.Задайте список из вещественных чисел.
# Напишите программу, которая найдёт разницу между максимальным и
# минимальным значением дробной части элементов.
# Пример:
# - [1.1, 1.2, 3.1, 5, 10.01] => 0.19

# array = [1.1, 1.2, 3.1, 5, 10.01]
# array2 = []
# for i in array:
#     if '.' in str(i):
#         array2.append(float('0.' + (str(i).split('.')[1])))
# print(max(array2)-min(array2))

# 4. Напишите программу, которая будет преобразовывать десятичное число
# в двоичное.
# Пример:
# - 45 -> 101101
# - 3 -> 11
# - 2 -> 10

# num = int(input('введите число: '))
# bin_num = ''
# while num > 0:
#     bin_num = str(num % 2) + bin_num
#     num = num // 2
# print(bin_num)

# 5. Задайте число. Составьте список чисел Фибоначчи,
# в том числе для отрицательных индексов.
# Пример:
# - для k = 8 список будет выглядеть так:
# [-21 ,13, -8, 5, −3, 2, −1, 1, 0, 1, 1, 2, 3, 5, 8, 13, 21]

fb1 = 0
fb2 = 1
n = int(input("Enter the number of terms: "))
i = 2
list = [fb1, fb2]
while i <= n:
  fibo = fb1 + fb2
  list.append(fibo)
  fb1 = fb2
  fb2 = fibo
  i+=1

fb1 = 0
fb2 = 1
i = 2
list2 = [fb1, fb2]
while i <= n:
  fibo = fb1 - fb2
  list2.append(fibo)
  fb1 = fb2
  fb2 = fibo
  i+=1
list2.reverse()
print(list2 + list)